C03/Nz100/Nz100_ref_predictor/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet_water
    {
        type            patch;
        nFaces          100;
        startFace       83590;
    }
    inlet_air
    {
        type            patch;
        nFaces          110;
        startFace       83690;
    }
    outlet_water
    {
        type            patch;
        nFaces          100;
        startFace       83800;
    }
    outlet_air
    {
        type            patch;
        nFaces          110;
        startFace       83900;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       84010;
    }
    atmosphere
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       84210;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          84000;
        startFace       84410;
    }
)

// ************************************************************************* //
